{
  "case_id": "ANNIV-25-SARAH",
  "build_version": "v1.0",
  "date_window": "Aug 23 – Sep 3, 2026",
  "last_updated": "Dec 17, 2025",
  "reveal_level": 7,
  "force_reveal_level": null,
  "reveal_schedule": {
    "0": "2025-12-25",
    "1": "2026-01-01",
    "2": "2026-02-01",
    "3": "2026-03-01",
    "4": "2026-04-01",
    "5": "2026-05-01",
    "6": "2026-06-01",
    "7": "2026-07-01",
    "8": "2026-08-01",
    "9": "2026-08-23"
  }

  "progress_by_level": {
    "0": 12,
    "1": 18,
    "2": 28,
    "3": 36,
    "4": 43,
    "5": 55,
    "6": 67,
    "7": 78,
    "8": 83,
    "9": 92
  },

  "story_by_level": {
    "0": "The system has recovered enough to know this: a surprise exists. It is refusing to elaborate.",
    "1": "The system has recovered enough to know this: initial data loss was caused by excessive secrecy and holiday excitement.",
    "2": "The system has recovered enough to know this: additional information became available after promising not to spoil anything.",
    "3": "The system has recovered enough to know this: progress accelerated once curiosity reached critical levels.",
    "4": "The system has recovered enough to know this: further recovery was unlocked after confirming this was, in fact, an amazing adventure.",
    "5": "The system has recovered enough to know this: some details remain hidden on purpose. This is a feature, not a bug.",
    "6": "The system has recovered enough to know this: remaining information is now being released slowly for quality control.",
    "7": "The system has recovered enough to know this: most systems are operational, but one key reveal remains under embargo.",
    "8": "The system has recovered enough to know this: final clarity is imminent, pending departure conditions.",
    "9": "Recovery complete. This is no longer a secret — it’s time to go."
  },

  "headline_by_level": {
    "0": "A 25th anniversary adventure - data integrity severely corrupted.",
    "3": "A 25th anniversary adventure — data integrity restoration begun.",
    "6": "A 25th anniversary adventure — data integrity restoration progressing.",
    "9": "A 25th anniversary adventure — restored."
  },

  "subline_by_level": {
    "0": "Dates are stable. The rest is being gently restored as the system allows.",
    "3": "Some details have returned. Others remain intentionally protected.",
    "6": "Most systems are functional. Surprise integrity remains high.",
    "9": "Core itinerary recovered. Surprise integrity: happily compromised."
  },

  "regions_by_level": {
    "0": "[REDACTED]",
    "3": "Earth: [REDACTED] + [REDACTED]",
    "6": "Earth: Country of [REDACTED] + [REDACTED] Coast",
    "9": "Kenya: Maasai Mara + Northern Conservancy + Indian Ocean Coast"
  },

  "ops_by_level": {
    "0": "Recovery in progress…",
    "2": "Two (possible?) locations + beach decompression (approx.)",
    "4": "Hiking + wellness + beach",
    "6": "Private [REDACTED] time + iconic [REDACTED] + coast",
    "8": "Small regional flights included",
    "9": "Full itinerary restored (final redactions optional)."
  },

  "sms_copy_by_level": {
    "0": "📡 Briefing Portal Update: New information recovered (still partially redacted).",
    "3": "📡 Briefing Portal Update: More of the story just came back online.",
    "6": "📡 Briefing Portal Update: A major chunk of the itinerary has been restored.",
    "9": "📡 Briefing Portal Update: The surprise is (almost) fully recovered."
  },

  "teasers": [
  {
    "title": "Teaser 01 — The shape of the adventure",
    "tag_by_level": {
      "0": "missing",
      "1": "partial",
      "2": "partial",
      "3": "partial",
      "4": "partial",
      "5": "partial",
      "6": "improving",
      "7": "nearly there",
      "8": "clear",
      "9": "restored"
    },
    "text_by_level": {
      "0": "An adventure built around [REDACTED].",
      "1": "An adventure built around contrast: [REDACTED] → [REDACTED] → [REDACTED].",
      "2": "An adventure built around contrast: immersion → [REDACTED] → rest.",
      "3": "An adventure built around contrast: deep focus, wide space, and [REDACTED].",
      "4": "An adventure built around contrast: movement, stillness, and [REDACTED].",
      "5": "An adventure built around contrast: exploration, intention, and [REDACTED].",
      "6": "An adventure built around contrast: wild places, quiet comfort, and [REDACTED].",
      "7": "An adventure built around contrast: iconic landscapes and [REDACTED].",
      "8": "An adventure built around contrast: one of the world’s great natural journeys.",
      "9": "An adventure built around contrast: safari immersion, conservation landscapes, and the Indian Ocean coast."
    }
  },
  {
    "title": "Teaser 02 — How you’ll move",
    "tag_by_level": {
      "0": "secured",
      "1": "secured",
      "2": "partial",
      "3": "partial",
      "4": "partial",
      "5": "partial",
      "6": "improving",
      "7": "nearly there",
      "8": "clear",
      "9": "restored"
    },
    "text_by_level": {
      "0": "Transportation details: [REDACTED].",
      "1": "Transportation details: multiple legs, intentionally [REDACTED].",
      "2": "Transportation details: short flights connecting very different [REDACTED].",
      "3": "Transportation details: small aircraft, big [REDACTED].",
      "4": "Transportation details: travel designed to be part of the [REDACTED].",
      "5": "Transportation details: movement that reveals scale and [REDACTED].",
      "6": "Transportation details: small regional flights with unforgettable [REDACTED].",
      "7": "Transportation details: intimate flights between remote places — names [REDACTED].",
      "8": "Transportation details: scenic regional flights linking dramatically different regions.",
      "9": "Transportation details: scenic regional flights linking Nairobi, the Maasai Mara, Borana, and the Indian Ocean coast."
    }
  },
  {
    "title": "Teaser 03 — The first immersion",
    "tag_by_level": {
      "0": "corrupted",
      "1": "partial",
      "2": "partial",
      "3": "partial",
      "4": "partial",
      "5": "partial",
      "6": "improving",
      "7": "nearly there",
      "8": "clear",
      "9": "restored"
    },
    "text_by_level": {
      "0": "The first setting: [REDACTED].",
      "1": "The first setting: remote, quiet, and intentionally [REDACTED].",
      "2": "The first setting: a place where attention sharpens and [REDACTED].",
      "3": "The first setting: a landscape meant to be observed, not [REDACTED].",
      "4": "The first setting: mornings and evenings matter more than [REDACTED].",
      "5": "The first setting: a vast place where stillness reveals [REDACTED].",
      "6": "The first setting: a protected wilderness known for scale and [REDACTED].",
      "7": "The first setting: one of the world’s great wildlife regions — name [REDACTED].",
      "8": "The first setting: a legendary wildlife landscape at its most dramatic.",
      "9": "The first setting: the Maasai Mara during the Great Migration."
    }
  },
  {
    "title": "Teaser 04 — The middle chapter",
    "tag_by_level": {
      "0": "missing",
      "1": "partial",
      "2": "partial",
      "3": "partial",
      "4": "partial",
      "5": "partial",
      "6": "improving",
      "7": "nearly there",
      "8": "clear",
      "9": "restored"
    },
    "text_by_level": {
      "0": "The middle chapter: [REDACTED].",
      "1": "The middle chapter: quieter, slower, and more [REDACTED].",
      "2": "The middle chapter: a place where walking replaces [REDACTED].",
      "3": "The middle chapter: guided movement, open views, and [REDACTED].",
      "4": "The middle chapter: a private landscape shaped by purpose and [REDACTED].",
      "5": "The middle chapter: a place defined by protection, balance, and [REDACTED].",
      "6": "The middle chapter: a conservation-focused retreat with deep [REDACTED].",
      "7": "The middle chapter: a globally respected conservation area — name [REDACTED].",
      "8": "The middle chapter: a renowned conservation landscape emphasizing walking and connection.",
      "9": "The middle chapter: Borana Conservancy — walking safaris, conservation, and space to breathe."
    }
  },
  {
    "title": "Teaser 05 — The water",
    "tag_by_level": {
      "0": "secured",
      "1": "partial",
      "2": "partial",
      "3": "partial",
      "4": "partial",
      "5": "partial",
      "6": "improving",
      "7": "nearly there",
      "8": "clear",
      "9": "restored"
    },
    "text_by_level": {
      "0": "The final setting: [REDACTED].",
      "1": "The final setting: light, warmth, and [REDACTED].",
      "2": "The final setting: unstructured days and [REDACTED] water.",
      "3": "The final setting: swimming, boats, and [REDACTED].",
      "4": "The final setting: a shoreline designed for slowing down and [REDACTED].",
      "5": "The final setting: a quiet coast far from crowds, names [REDACTED].",
      "6": "The final setting: an intimate beach retreat with long meals and sea air.",
      "7": "The final setting: a celebrated beach hideaway — exact location [REDACTED].",
      "8": "The final setting: a beloved lodge on a warm ocean coast.",
      "9": "The final setting: Kinondo Kwetu on Kenya’s Indian Ocean coast."
    }
  },
  {
    "title": "Teaser 06 — The soft stuff",
    "tag_by_level": {
      "0": "protected",
      "1": "protected",
      "2": "partial",
      "3": "partial",
      "4": "partial",
      "5": "partial",
      "6": "improving",
      "7": "nearly there",
      "8": "clear",
      "9": "restored"
    },
    "text_by_level": {
      "0": "Wellness details: [REDACTED].",
      "1": "Wellness details: intentional pauses built [REDACTED].",
      "2": "Wellness details: yoga, massage, and [REDACTED].",
      "3": "Wellness details: yoga, massage, and movement [REDACTED].",
      "4": "Wellness details: wellness woven into the rhythm of [REDACTED].",
      "5": "Wellness details: care, movement, and rest — specifics [REDACTED].",
      "6": "Wellness details: yoga, massage, walking, and time to truly [REDACTED].",
      "7": "Wellness details: daily rituals for body and mind — location [REDACTED].",
      "8": "Wellness details: yoga, massage, walks, and unhurried days.",
      "9": "Wellness details: yoga, massage, walks, horseback riding, and beach time."
    }
  }
]
}
